{
    "projects": [
        {
            "name": "Descriptive Alternative Text Generator",
            "description": [
                "Utilized Azure’s Image Analysis AI and Google’s Generative AI to generate descriptive alternate text for images. ",
                "Implemented a user-friendly interface for easy interaction with the generation system, prioritizing accessibility. ",
                "Incorporated Western Washington University’s theme and components library, Ashlar, to provide seamlessintegration into Western’s existing website. "
            ],
            "url": "https://github.com/wwu-webtech/descriptive-alt-text-generator",
            "images": [
                "datg1.png",
                "datg2.png",
                "datg3.png",
                "datg4.png",
                "datg5.png"
            ]
        },
        {
            "name": "Data Privacy Map",
            "description": [
                "Collaborated with a team of four to develop an interactive data privacy map, utilizing the MERN stack. ",
                "Provides comprehensive insights into data privacy laws across the United States and globally. ",
                "Integrated client feedback and suggestions in the web app. "
            ],
            "url": "https://github.com/nguyenq9/EpistimisLLC"
        },
        {
            "name": "Deadwood the digital board game",
            "description": [
                "Worked on a team of three to implement a digital version of the board game Deadwood. ",
                "Translated the complex rules and gameplay mechanics of the physical board game into a digital experience. ",
                "Developed a user-friendly and visually appealing interface using JavaFX, including game boards, player pieces, cards, and interactive components, providing an immersive gaming experience. ",
                "Added sound effects and animations to enhance the gaming experience and create a dynamic atmosphere. "
            ],
            "url": "https://github.com/nguyenq9/Deadwood-Game"
        }
    ],
    "socials": [
        {
            "type": "github",
            "url": "https://github.com/nguyenq9"
        },
        {
            "type": "linkedin",
            "url": "https://www.linkedin.com/in/quoc-thai-nguyen-589261223/"
        },
        {
            "type": "instagram",
            "url": "https://www.instagram.com/thainguyen.exe/"
        },
        {
            "type": "email",
            "url": "mailto:nguyenq9@outlook.com"
        }
    ],
    "about": "Hi my name is Thai Nguyen! 👋<br>I'm a budding web developer and Computer Science student at Western Washington University.<br>I like to build engaging websites and make cool apps using AI tools like Azure Computer Vision <br>and Vertex AI. In the past, I was a math and computer science tutor at Western, helping students<br>better understand concepts taught in their classes. I'm currently working for Western's <br>Web Communications Technology team to build web pages and web apps that will help the university.<br>When I'm not in class or at work, you can find me playing pickleball, disc golf, or trying new recipes.",
    "experience": [
        {
            "title": "Web Developer III",
            "company": "Web Communication Technologies",
            "location": "Bellingham, WA",
            "date": {
                "start": "Apr 2024",
                "end": "Present "
            },
            "description": [
                "Worked with various Content Management Systems like WordPress and Drupal to convert PDF files to web pages for procedures and policies.",
                "Utilized SiteImprove to guarantee quality assurance and comply with accessibility guidelines.",
                "Created a web app that utilizes AI to generates descriptive alternative text for uploaded images."
            ]
        },
        {
            "title": "Web Development Intern",
            "company": "Web Communication Technologies",
            "location": "Bellingham, WA",
            "date": {
                "start": "Jan 2024",
                "end": "Apr 2024"
            },
            "description": [
                "Revise Western Washington University's user-facing content to comply with W3C accessibility standards.",
                "Evaluate existing technologies employed by the university for reporting and, where feasible, addressing accessibility concerns.",
                "Develop standalone web application utilizing AI to generate descriptive alternative text."
            ]
        },
        {
            "title": "Computer Science Tutor",
            "company": "Western Washington University",
            "location": "Bellingham, WA",
            "date": {
                "start": "Mar 2022",
                "end": "Jun 2023"
            },
            "description": [
                "Guided students in comprehending programming concepts, with a focus on Racket, Python, & Java",
                "Provided one-on-one support to students taking introductory programming courses like Computer Systems, Algorithms and Data Structures, and Functional Programming."
            ]
        },
        {
            "title": "Math Center Tutor",
            "company": "Western Washington University",
            "location": "Bellingham, WA",
            "date": {
                "start": "Sep 2021",
                "end": "Mar 2022"
            },
            "description": [
                "Assisted college students with 200 and 300-level math coursework.",
                "Built strong communication and collaboration skills through group work.",
                "Led and facilitated study groups of 3 to 4 people to enhance students’ understanding of math concepts."
            ]
        }
    ],
    "skills": {
        "languages" : ["Java", "Python", "C", "C++", "JavaScript", "HTML/CSS", "Racket"],
        "frameworks" : ["React", "Node", "WordPress", "Material-UI", "JavaFX", "Express", "Astro"],
        "developer" : ["Git", "VS Code", "Bootstrap", "Vercel", "Heroku", "Azure", "AWS"],
        "interests" : ["Track & Field", "Football", "Pickleball", "Cooking", "Foraging"]
    }
}